import asyncio
import requests
import os
import re
import time
import random
import textwrap
import aiohttp
import aiofiles
import datetime
import numpy as np
from config import *
from pyrogram.types import *
from config import START_video_URL
from pyrogram import filters, Client
from pyrogram.types import Message, InlineKeyboardMarkup, InlineKeyboardButton
from VeGaXMusic import app


# ▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂
# ▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂[𝗩.𝗘.𝗚.𝗔]▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂
#──██████──────██████───█████████████──────██████████████───████████████████────
#──██──██──────██──██───██─────────██────██────────────██───██────────────██────
#──██──██──────██──██───██──█████████───██───████████████───██───███████──██────
#──██──██──────██──██───██──██──────────██──██──────────────██───██───██──██────
#──██──██──────██──██───██──██──────────██──██──────────────██───██───██──██────
#──██──██──────██──██───██──██──────────██──██──────────────██───██───██──██────
#──██──██──────██──██── ██──██──────────██──██──────────────██───██───██──██───
#──██──██──────██──██───██──█████████───██──██───███████────██───███████──██────
#──██───██────██───██───██─────────██───██──██───██────██───██────────────██────
#───██───██──██───██────██──█████████───██──██───████──██───██───███████──██────
#────██───████───██─────██──██──────────██──██─────██──██───██───██───██──██────
#─────██───██───██──────██──██──────────██───██────██──██───██───██───██──██────
#──────██──────██───────██──██───────────██───██───██──██───██───██───██──██────
#───────██────██────────██──█████████─────██──███████──██───██───██───██──██────
#────────██──██─────────██─────────██──────██─────────██────██───██───██──██────
#─────────████──────────█████████████───────████████████────███████───██████────
# ▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂
# ▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂[𝗩.𝗘.𝗚.𝗔]▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂
# ̷𝖾𝙙𝙚𝙥𝙡𝙤𝙮𝙚𝙙 𝙨𝙪𝙘𝙘𝙚𝙨𝙨𝙛𝙪𝙡𝙡𝙮
# (2024-2025) 𝙗𝙮: @𝙏𝙊𝙋𝙑𝙀𝙂𝘼
# 𝙂𝙧𝙚𝙚𝙩𝙞𝙣𝙜𝙨 𝙛𝙧𝙤𝙢 : 𝙑𝙚𝙂𝙖


#سورس جاك ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
#سورس جاك ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
#سورس جاك ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓


@app.on_message(filters.command(["سورس","جاك","السورس","السورس","ꜱʜᴇɪᴋʜ"], ""), group=12662)
async def kinhsker(client: Client, message: Message):
    await message.reply_video(
        video=START_video_URL,
        caption=f"""<b>╭◉ᚐᴡᴇʟᴄᴏᴍᴇ ᴛᴏ\n╰⬣<a href={SUPPORT_CHANNEL}>ᚐꜱʜᴇɪᴋʜ ꜱᴏᴜꝛᴄᴇ</a>\n╭⊚<a href={SUPPORT_GROUP}>ᚐɢꝛᴏᴜᴘ</a>\n╰◉<a href={QURAN_CHANNELL}>ᚐᴄᴧʟɴɴʟᴇ</b>""",
        reply_markup=InlineKeyboardMarkup(
            [
                [
                    InlineKeyboardButton(
                        "ꜱʜᴇɪᴋʜ", url=SUPPORT_CHANNEL),
                ],[
                    InlineKeyboardButton(
                        "ᴄᴏᴇ ᴏꜰ ꜱʜᴇɪᴋʜ", url=QURAN_CHANNELL),

                ],

            ]

        ),

    )




    
    
#مصنع جاك خاص لمطورين جاك ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
#مصنع جاك خاص لمطورين جاك ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓




cclyof = []
@app.on_message(filters.command(["قفل مصنع", "تعطيل مصنع"], ""), group=27181882)
async def cclylock(client, message):
   get = await client.get_chat_member(message.chat.id, message.from_user.id)
   if message.from_user.id == 6753126490:
      if message.chat.id in cclyof:
        return await message.reply_text("مصنع معطل من قبل")
      cclyof.append(message.chat.id)
      return await message.reply_text("تم تعطيل مصنع بنجاح")
   else:
      return await message.reply_text("هذا الامر يخص ❪ مطورين جاك ❫ بس")
   


@app.on_message(filters.command(["فتح مصنع", "تفعيل مصنع"], ""), group=288)
async def cclyopen(client, message):
   get = await client.get_chat_member(message.chat.id, message.from_user.id)
   if message.from_user.id == 8040979911:
      if not message.chat.id in cclyof:
        return await message.reply_text("مصنع مفعل من قبل\n")
      cclyof.remove(message.chat.id)
      return await message.reply_text("تم فتح مصع بنجاح")
   else:
      return await message.reply_text("هذا الامر يخص ❪ مطورين جاك ❫ بس")


@app.on_message(filters.command(["مصنع","ᴍᴀᴋᴇʀ","مصانع","المصانع"], ""), group=32799805)
async def bb(client, message):
        if message.chat.id in cclyof:
          return await message.reply_text("مصنع معطل من قبل جاك")
        bot_user = await client.get_me()
        bot_id = bot_user.id
        bot_name = bot_user.first_name
        user = await client.get_users(bot_id)
        owner = user.first_name        
        
        await message.reply_video(
            video=f"https://t.me/kafra_wi_1/124",
            caption=f"<b>{bot_name}\n<blockquote>╮⊚ هنا كل ما يخص مصانع جاك\n|⊚ هذه المصانع الوحيده لدي جاك\n╯⦿ احذرو التقليد..؟!!</blockquote></b>",
             reply_markup=InlineKeyboardMarkup(
            [
                [
                    InlineKeyboardButton(
                        "❥͜͡ᴍᴜꜱɪᴄ✘ꜱʜᴇɪᴋʜ", url=f"https://t.me/M_D_O_1_bot"),           
                ],[
                    InlineKeyboardButton(
                        "ꜱʜᴇɪᴋʜ", url=SUPPORT_CHANNEL),
                ],[
                    InlineKeyboardButton(
                        "˹✘˼", callback_data="close"),

               ],
          ]
        ),
    )
        





##مميزات ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
##مميزات ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓

@app.on_message(filters.command(["مميزات","المميزات"], ""), group=8866666600011287601108)
async def mmmezat(client, message):
        await message.reply_text(f"""<b>◉<blockquote> قايمه مميزات سورس جاك: </u></blockquote>

<blockquote>╮◉  المطور
│᚜◉ اصراحه 
│᚜◉ ايدي 
│᚜◉ قول 
│᚜◉ كت
│᚜◉ تويت
│᚜◉ قولي
│᚜◉ جمالي
│᚜◉ اذاعه
│᚜◉ غنيلي 
│᚜◉ بايو
│᚜◉ اسال
│᚜◉ مهنتي
│᚜◉ نكت
│᚜◉ صورتي
│᚜◉ مميزات
│᚜◉ همسه
│᚜◉ العاب
│᚜◉ مين فالكول
│᚜◉ انا فين
│᚜◉ لو خيروك
│᚜◉ بيقول ايه
│᚜◉ احكام
│᚜◉ بحث
│᚜◉ يوتيوب
│᚜◉ تنزيل 
│᚜◉ اصراحه
│᚜◉ اسمي
│᚜◉ بايو
│᚜◉ انذار
│᚜◉ سورس 
│᚜◉ كتم
│᚜◉ حظر
│᚜◉ تقيد
│᚜◉ تاك 
│᚜◉ صور
│᚜◉ استوري
│᚜◉ قرآن
│᚜◉ يوتيوب
│᚜◉ مشاهده
│᚜◉ بحث
│᚜◉ رتبتي
│᚜◉ رتبته
│᚜◉ لقبه
│᚜◉ لقبي
│᚜◉ رابط
│᚜◉ ترويج للبوت
│᚜◉ المشرفين
│᚜◉ اضف رد
│᚜◉ صلاحياته
│᚜◉ صلاحياتي
│᚜◉ المالك
│᚜◉ الاذكار
│᚜◉ اوامر
│᚜◉ طرد البوتات 
│᚜◉ رسايلي
│᚜◉ رسايله
│᚜◉ كشف
│᚜◉ تف
│᚜◉ مح
│᚜◉ تخ
│᚜◉ كشف البوتات
│᚜◉ فحص الجروب 
│᚜◉ افتح الكول
│᚜◉ اقفل الكول 
│᚜◉ مانع تصفيه
│᚜◉ مين رفعني
│᚜◉ ردود متعدده
│᚜◉ الكولات النشطه 
│᚜◉ الفيديوهات النشطه 
│᚜◉ معلومات التنصيب
│᚜◉ رفع مطور البوت تلقائيا ادمن
│᚜◉ ترحيب بمطور البوت
│᚜◉ تحويل ملصقات لصور
│᚜◉ تغير اسم الجروب
│᚜◉ تنبيه بتغير اسم الجروب
│᚜◉ تغير بايو الجروب
│᚜◉ تنبيه بتغير صوره الجروب
│᚜◉ مسح صوره الجروب 
│᚜◉ الاحصائيات
│᚜◉ تبيه بوقت صلاه
│᚜◉ دعوه في كول
│᚜◉ القسم الحمايه
│᚜◉ تحويل ملصق لصوره 
│᚜◉ ترحيب بالمطور و رفعه تلقائيا ادمن
│᚜◉ ترحيب دخول و خروج
│᚜◉ رفع و تنزيل مطور 
│᚜◉ مكالمات النشطه
│᚜◉ تبيه بفتح+قفل الكول
│᚜◉  دعوه فالخاص بتاع البوت
│᚜◉ تنبيه..بانضمام بوت في الجروبات
│᚜◉ تلغراف ميديا بالرد عالصوره
│᚜◉ حول ملصق بالرد عالصوره
╯◉  بث مباشر للقنوات</blockquote></b>""")    



@app.on_message(filters.command(["تعليمات","ارشادات"], ""), group=886666608)
async def ddarqg(client, message):
        await message.reply_text(f"""◉<u> هنا قايمه بتعلميات الاستخدام: </u>\n
<blockquote>1- تعين اسم الجروب + بارسال اسم جديد للجروب
2- مسح اسم الجروب + لمسح اسم الجروب الحالي
3- تغير صوره الجروب +بارسال صوره جديده للجروب
4- مسح صوره الجروب + لازاله صوره الجروب موحوده
5- تغير بايو الجروب + بارسال بايو جديد
6- لقبي + بدون ريب
7- لقبه + بريب عالشخص
8- رسايلي + بدون ريب
9- رسايله + بريب عالشخص
10- حذف + بريب عالرساله
11- كشف  + بريب عالشخص
11- جمالي + بدون ريب
12- صورتي + بدون ريب
13- مهنتي + بدون ريب
14- رابط+ لجلب رابط الجروب
15- مين رفعني + بدون ريب
16- رتبتي + بدون ريب
17- رتبته + بريب عالشخص
18- صلاحياتي + بدون ريب
19- صلاحياته + بريب عالشخص
20- همسه + بريب عالشخص
21- تحميل + باسم الاغنيه مراد تحملها
22- يوتيوب + باسم فديو او اغنيه
23- مشاهده + باسم فديو او اغنيه 
24- تحويل ملصق لصوره + بريب عالملصق
25- توحيل الصوره لملصق + بريب عالصوره
26- تليغراف ميديا + بريب عالفيديو او صوره
27- كشف بوتات + بدون ريب
28- المشرفين + بدون ريب
29- وقت الصلاه + بدون ريب
30- الساعه + بدون ريب
31- طرد البوتات + بدون ريب
32- زخرفه + بارسال كلمه مراد زخرفتها
33- بحث + باسم الاغنيه او الفيديو
34- انذار + بريب عالشخص
35- تفعيل + لتفعيل الحمايه
36- تعطيل + لتعطيل الحمايه
37- اوامر + لتحكم في الجروب
38- قولي + بالرد الكلام 
39- حظر + بريب او الرد الشخص او الايدي او اليوزر
40- كتم + بريب او الرد الشخص او الايدي او اليوزر
41- تقيد + بريب او الرد الشخص او الايدي او اليوزر
42- المحظورين + لجلب المحظورين
43- المقيدين + لجلب المقيدين
44- المكتومين + لجلب المكتومين
45- رفع منشئ + بريب عالشخص
46- رفع مالك + بريب عالشخص 
47- رفع مشرف + بريب عالشخص 
48- رفع مطور + بريب عالشخص 
49- رفع مميز + بريب عالشخص 
50- رفع ادمن + بريب عالشخص
51- رفع منشي اساسي + بريب عالشخص
52- ترويج للبوت + بريب واذاعه
53- معلومات التنصيب + يجلب معلومات البوت
54- فحص الجروب + لفحص الجروب كامل
55- ابراج + لجلب قائمة الابراج
56- العاب + لجلب قائمه الالعاب
57-بيقول ايه + بالرد علي ملف الصوتي لستخراج لنص</blockquote>""")


        

#اصدار جاك ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
#اصدار جاك ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
#اصدار جاك ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓


@app.on_message(filters.command(["حول","ʀᴇʟᴇᴀꜱᴇ"], ""), group=8236)
async def handle_user_info(client, message):
    user = await client.get_chat("Vegaxone")
    name = user.first_name
    if user.photo:
        photo = await app.download_media(user.photo.big_file_id)
        await message.reply_photo(photo, caption=f"""<b><blockquote>
╭⦿  ꜱᴏᴜꝛᴄᴇ.ɴᴧᴍᴇ: ꜱʜᴇɪᴋʜ
│᚜⦿ ꜱʏꜱᴛᴇᴍ: ᴘʏᴛʜᴏɴ
│᚜⦿ ʟᴧɴɢᴜᴧɢᴇ: ɪꜱ ᴧꝛᴧʙɪᴄ
│᚜⦿ ꝛᴇʟᴇᴧꜱᴇ: 2.1 ᴠ
│᚜⦿ ᴅᴧᴛᴇ ᴄꝛᴇᴧᴛᴇᴅ: 1 -8 -2016
╰⦿  ᴏᴡɴᴇꝛ ᴏꜰ ꜱʜᴇɪᴋʜ:[ @wwvvwt ]
</b></blockquote>""", 
            reply_markup=InlineKeyboardMarkup(
                [
                    [
                        InlineKeyboardButton(
                            "ꜱʜᴇɪᴋʜ", url=SUPPORT_CHANNEL)    
                    ],
                ]
            ),
        )
    else:
        await message.reply_text(f"""<b><blockquote>
╭⦿  ꜱᴏᴜꝛᴄᴇ.ɴᴧᴍᴇ: ꜱʜᴇɪᴋʜ
│᚜⦿ ꜱʏꜱᴛᴇᴍ: ᴘʏᴛʜᴏɴ
│᚜⦿ ʟᴧɴɢᴜᴧɢᴇ: ɪꜱ ᴧꝛᴧʙɪᴄ
│᚜⦿ ꝛᴇʟᴇᴧꜱᴇ: 2.1 ᴠ
│᚜⦿ ᴅᴧᴛᴇ ᴄꝛᴇᴧᴛᴇᴅ: 1 -8 -2016
╰⦿  ᴏᴡɴᴇꝛ ᴏꜰ ꜱʜᴇɪᴋʜ:[ @wwvvwt ]
</b></blockquote>""",    
            reply_markup=InlineKeyboardMarkup(
                [
                    [
                        InlineKeyboardButton(
                            "ꜱʜᴇɪᴋʜ", url=SUPPORT_CHANNEL
                        )
                    ]
                ]
            )
        )
